---
kind: method
id: M:Autodesk.Revit.UI.Macros.DocumentEntryPoint.#ctor
source: html/6ae6fa94-1107-b316-ec01-afdd560338a2.htm
---
# Autodesk.Revit.UI.Macros.DocumentEntryPoint.#ctor Method

Initializes a new instance of the DocumentEntryPoint class

## Syntax (C#)
```csharp
public DocumentEntryPoint()
```